In [2]:
import pandas as pd

In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#    variable print it.


list = [2,3,4,2,3,6,4,8,2,1]
len(list)

10

In [5]:
list = pd.Series(list)

In [6]:
list

0    2
1    3
2    4
3    2
4    3
5    6
6    4
7    8
8    2
9    1
dtype: int64

In [7]:

#Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],
                   'Age' : [25, 30, 27],
                   'Gender' : ['Female','Male','Female'] })

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas dataframe is 2 D table of data with rows and columns, where each column can have a different data type.

Pandas Series is array like object which can hold any data type

example:

In [21]:
df

        0     1       2
0   Alice   Bob  Claire
1      25    30      27
2  Female  Male  Female

In [19]:

ages = pd.Series([25, 'none', 35])
print(ages)

0      25
1    none
2      35
dtype: object

In [10]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [11]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:

df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [14]:


df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [15]:
df.count()

Name      3
Age       3
Gender    3
dtype: int64

In [16]:
df.groupby('Gender').mean()

/tmp/ipykernel_22220/3774296011.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Gender').mean()

         Age
Gender
Female  26.0
Male    30.0

In [17]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# Both are Mutuable

In [18]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.


Name = pd.Series(['Alice','Bob','Claire'])
Age = pd.Series([25, 30, 27])
Gender = pd.Series(['Female','Male','Female'])
df=pd.DataFrame([Name,Age,Gender])
df

        0     1       2
0   Alice   Bob  Claire
1      25    30      27
2  Female  Male  Female